/**
 * HTTP 请求错误信息集合
 */
const HttpErrorInfo = {
  default: '网络异常或服务器连接失败',
  network: '网络异常或服务器连接失败',
  aborted: '网络异常或服务器连接失败',
  timeout: '网络异常或服务器连接失败',

  // 3xx: 重定向，需要进一步的操作以完成请求
  301: '网络异常或服务器连接失败',
  302: '网络异常或服务器连接失败',
  303: '网络异常或服务器连接失败',
  304: '网络异常或服务器连接失败',
  305: '网络异常或服务器连接失败',
  306: '网络异常或服务器连接失败',
  307: '网络异常或服务器连接失败',

  // 4xx: 客户端错误
  400: '网络异常或服务器连接失败',
  401: '网络异常或服务器连接失败',
  402: '网络异常或服务器连接失败',
  403: '网络异常或服务器连接失败',
  404: '网络异常或服务器连接失败',
  405: '网络异常或服务器连接失败',

  406: '网络异常或服务器连接失败',
  407: '网络异常或服务器连接失败',
  408: '网络异常或服务器连接失败',
  409: '网络异常或服务器连接失败',
  410: '网络异常或服务器连接失败',

  411: '网络异常或服务器连接失败',
  412: '网络异常或服务器连接失败',
  413: '网络异常或服务器连接失败',
  414: '网络异常或服务器连接失败',
  415: '网络异常或服务器连接失败',

  416: '网络异常或服务器连接失败',
  417: '网络异常或服务器连接失败',

  // 5xx: 服务器错误
  500: '网络异常或服务器连接失败',
  501: '网络异常或服务器连接失败',
  502: '网络异常或服务器连接失败',
  503: '网络异常或服务器连接失败',
  504: '网络异常或服务器连接失败',
  505: '网络异常或服务器连接失败'
};

export default HttpErrorInfo;
